app/controllers/messages_controller.rb

SELECT * FROM `messages` ORDER BY create_at DESC LIMIT 0, 3
SELECT count(*) AS count_all FROM `messages`
---
  def index
  #  @messages = Message.all
  @messages = Message.paginate(:all,:page=>params[:page],:order=>'create_at DESC')

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def show
    @message = Message.find(params[:id])

SELECT * FROM `messages` WHERE (`messages`.`id` = 1)
---
  def edit
    @message = Message.find(params[:id])

INSERT INTO `messages` (`title`, `created_at`, `create_at`, `website_url`, `body`, `reply`, `updated_at`, `name`) VALUES('fsdf', '2013-08-12 08:07:43', '2013-08-12 08:07:00', 'fdf', 'fdsfsdf', 'fsdf', '2013-08-12 08:07:43', 'test1')
---
  def create
    @message = Message.new(params[:message])

    respond_to do |format|
      if @message.save